app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "sad"], ["created_at", "2021-05-27 18:46:11.679537"], ["updated_at", "2021-05-27 18:46:11.679537"], ["user_id", 1]]
---
  def create
    @post = Post.new(
     content: params[:content],
     user_id: @current_user.id
    )
    if @post.save