app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sd"], ["email", "sds"], ["created_at", "2021-05-27 18:17:23.551217"], ["updated_at", "2021-05-27 18:17:23.551217"], ["image_name", "default_user.jpg"], ["password", "dsds"]]
---
  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: "default_user.jpg",
      password: params[:password]
    )
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "1.jpg"], ["updated_at", "2021-05-27 18:46:04.306871"], ["id", 1]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]

    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "gdfg"], ["password", "fgdgf"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:email], password: params[:password])